15036829975/51_STM32_CODE/stm32Project/6-6输入捕获&PWMI模式测试频率占空比/Hardware/IC.c
#include "stm32f10x.h"                  // Device header
void IC_Init(void)
{
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3,ENABLE);
	  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
		
		GPIO_InitTypeDef GPIO_Initstructure;
		GPIO_Initstructure.GPIO_Mode= GPIO_Mode_IPU;
		GPIO_Initstructure.GPIO_Pin= GPIO_Pin_6;
		GPIO_Initstructure.GPIO_Speed= GPIO_Speed_50MHz;
		GPIO_Init(GPIOA,&GPIO_Initstructure);  //初始化GPIO
	
	
		TIM_InternalClockConfig(TIM3);//选择时钟
	
	
		TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
		TIM_TimeBaseInitStructure.TIM_ClockDivision=TIM_CKD_DIV1;
		TIM_TimeBaseInitStructure.TIM_CounterMode=TIM_CounterMode_Up;
		TIM_TimeBaseInitStructure.TIM_Period=65536-1;      //   ARR
		TIM_TimeBaseInitStructure.TIM_Prescaler=72-1;    //   PSC
		TIM_TimeBaseInitStructure.TIM_RepetitionCounter=0;
		TIM_TimeBaseInit(TIM3,&TIM_TimeBaseInitStructure);

		TIM_ICInitTypeDef	TIM_ICInitStructure;
		TIM_ICInitStructure.TIM_Channel=TIM_Channel_1;
		TIM_ICInitStructure.TIM_ICFilter=0xF;
		TIM_ICInitStructure.TIM_ICPolarity=TIM_ICPolarity_Rising;
		TIM_ICInitStructure.TIM_ICPrescaler=TIM_ICPSC_DIV1;
		TIM_ICInitStructure.TIM_ICSelection=TIM_ICSelection_DirectTI;
		TIM_ICInit(TIM3,&TIM_ICInitStructure);
		
		TIM_SelectInputTrigger(TIM3,TIM_TS_TI1FP1);
		TIM_SelectSlaveMode(TIM3,TIM_SlaveMode_Reset);
		
		TIM_Cmd(TIM3,ENABLE);
	}

	
	uint32_t IC_GetFreq(void)
	{
		return 1000000/(TIM_GetCapture1(TIM3)+1);
		
		
		
	}
